app/views/layouts/shared/_my_posts.html.erb

<div class='title'>
  My Items <small><%= current_user.items.size %></small>
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]