app/controllers/items_controller.rb

SELECT "tags".* FROM "tags" WHERE (lower(name) = 'ruby on rails')
SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
SELECT "items".* FROM "items" JOIN taggings items_taggings_f34561d ON items_taggings_f34561d.taggable_id = items.id AND items_taggings_f34561d.taggable_type = 'Item' AND items_taggings_f34561d.tag_id = 5 ORDER BY "items"."updated_at" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "communities" INNER JOIN "associates" ON "communities"."id" = "associates"."community_id" WHERE "associates"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def index
    if params[:tag]
      @items = Item.tagged_with(params[:tag])
    elsif params[:community_id]
      # Community has_many :items, :through => :users
      # @items = Item.where(user_id: Community.find(params[:community_id]).users.pluck(:id))
      @items = Community.find(params[:community_id]).items
    else
      @items = Item.all
    end
    if params[:user_id]
      @other_user = User.find(params[:user_id])
      @items = @items.where( user_id: @other_user.id)
      @communities_joined = @other_user.communities
      @other_user = nil if current_user == @other_user
    else
      @communities_joined = current_user.communities if user_signed_in?
    end
    @items = @items.order(updated_at: :desc).paginate(page: params[:page], per_page: 10)

INSERT INTO "items" ("created_at", "description", "photo", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Sep 2013 05:31:46 UTC +00:00], ["description", "sdfsdf"], ["photo", "c.jpg"], ["updated_at", Sun, 08 Sep 2013 05:31:46 UTC +00:00], ["user_id", 1]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "photo" = ?, "updated_at" = ? WHERE "items"."id" = 8  [["photo", "c.jpg"], ["updated_at", Sun, 08 Sep 2013 14:55:17 UTC +00:00]]
---
  def update
    respond_to do |format|
      authorize_action_for(@item)
      if @item.update(item_params)

SELECT items.id FROM "items"
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN items ON items.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Item' AND taggings.context = 'tags') AND (taggings.taggable_id IN(1,2,3,4,5,6,7,8,9,10,11)) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE (name LIKE '%te%') LIMIT 10
---
  def tags
    @tags = Item.tag_counts

    @tags = @tags.where('name LIKE ?', "%#{params[:q]}%") if params[:q]
    @tags = @tags.limit(10)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_communities_joined
      if params[:user_id]
        @communities_joined = User.find(params[:user_id]).communities